package Lesson1_task2

//В любом учебнике есть задачи про космос. Объяви переменные и выведи данные о полете
// в космос первого человека.
//– Запиши в новую переменную year год полета Юрия Гагарина в космос;
//– Объяви и проинициализируй переменные hour и minute – час и минуту взлета соответственно;
//– Выведи год, час и минуту взлета по одной переменной на каждую строку;
//– Затем измени значения переменных hour и minute, чтобы они теперь имели значение
// часа и минуты посадки;
//– Выведи время посадки в одной строке в формате [часы:минуты]. Пример: 10:55.
//Определи, где в программе переменные должны задаваться через val, а где через var.
//Данные для задачи:
//Год полета – 1961
//Взлет – 09:07
//Посадка – 10:55
fun main() {
    val yearFlight = 1961
//    val hour= 9
//    val minute= 7
    println("Год полета – $yearFlight")
    val hourTakeoff = "09"
    val minuteTakeoff = "07"
    val hourLanding="10"
    val minuteLanding="55"
    println("Взлет – $hourTakeoff:$minuteTakeoff")
    println("Посадка – $hourLanding:$minuteLanding")
//    Подсказка для вывода: какой метод печати в консоль не делает перенос в конце строки?
//    Это метод print  2
}