package ru.kir2s6.Lesson1_task1
//– Далее нужно сделать так, чтобы программа хранила количество работников
// данного интернет-магазина (2000). Подбери подходящее наименование переменной,
// присвой ей значение и распечатай;
//– Далее представим, что один работник уволился.
// Закомментируй предыдущий код с распечаткой количества работников,
// присвой новое значение количества работников этой переменной и распечатай в консоль.
fun main() {
//    – Для начала выведи в консоль значения всех объявленных ранее переменных;
    val numberOrders=75
    val thanksPurchase= "спасибо за покупку"
    println("С вас $numberOrders рублей, $thanksPurchase")
//    var storeWorker = 20
    val storeWorker=19
    println("Количество работников магазина $storeWorker")

}